<?php
$pathToImage = 'include_files/images/sections/';
$arTopMenu = [
    'portal'    => [
        'link'      => '/verstka/portal.php',
        'title'     => 'Информационный портал',
        'dropdown'  => [
            [
                'title'     => 'Оружие',
                'link'      => '#',
                'parent'    => 'line__3',
                'background'=> $pathToImage . 'bgd/bg_weapon.jpg',
                'image'     => $pathToImage . 'items/weapon.png',
                'desc'      => 'ТТХ, отзывы и сравнения, ремонт и модернизация, ' .
                                'правила ведения огня и тренировки. ' .
                                'И многое другое об оружии',
                'dropdown'  => [
                    [
                        'title'     => 'Об оружии и не только',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Обзор',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Уход за оружием',
                        'link'      => '#',
                    ],
                ],
            ],
            [
                'title'     => 'Снаряжение',
                'link'      => '#',
                'parent'    => 'line__3',
                'background'=> $pathToImage . 'bgd/bg_amunition.jpg',
                'image'     => $pathToImage . 'items/amunition.png',
                'desc'      => 'ТТХ, отзывы и сравнения, ремонт и модернизация, ' .
                    'правила ведения огня и тренировки. ' .
                    'И многое другое...',
                'dropdown'  => [
                    [
                        'title'     => 'Активные средства защиты',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'К боевому применению',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Пассивные средства защиты',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'По роду выполняемых задач',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Походное',
                        'link'      => '#',
                    ],
                ],
            ],
            [
                'title'     => 'Стратегия и тактика',
                'link'      => '#',
                'parent'    => 'line__3',
                'background'=> $pathToImage . 'bgd/bg_strategy.jpg',
                'image'     => $pathToImage . 'items/strategy.png',
                'desc'      => 'ТТХ, отзывы и сравнения, ремонт и модернизация, ' .
                    'правила ведения огня и тренировки. ' .
                    'И многое другое об оружии',
                'dropdown'  => [
                    [
                        'title'     => 'Армии России и мира',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Здоровье',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'История и опыт',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Спец. подразделения',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Тактика',
                        'link'      => '#',
                    ],
                ],
            ],
            [
                'title'     => 'Медицинское обеспечение',
                'link'      => '#',
                'parent'    => 'line__2',
                'background'=> $pathToImage . 'bgd/bg_medical.jpg',
                'image'     => $pathToImage . 'items/medical.png',
                'desc'      => 'ТТХ, отзывы и сравнения, ремонт и модернизация, ' .
                    'правила ведения огня и тренировки. ' .
                    'И многое другое об оружии',
                'dropdown'  => [
                    [
                        'title'     => 'Медицинское снаряжение',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Первая помощь',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Средства личной гигиены',
                        'link'      => '#',
                    ]
                ],
            ],
            [
                'title'     => 'Организационные материалы',
                'link'      => '#',
                'parent'    => 'line__2',
                'background'=> $pathToImage . 'bgd/bg_materials.jpg',
                'image'     => $pathToImage . 'items/materials.png',
                'desc'      => 'ТТХ, отзывы и сравнения, ремонт и модернизация, ' .
                    'правила ведения огня и тренировки. ' .
                    'И многое другое об оружии',
                'dropdown'  => [
                    [
                        'title'     => 'Законодательство РФ',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Пособия и инструкции',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Сценарии и планы',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Техника безопасности',
                        'link'      => '#',
                    ],
                ],
            ],
        ],
    ],
    'catalog'   => [
        'link'      => '/verstka/catalog.php',
        'title'     => 'Каталог',
        'dropdown'  => [
            [
                'title'     => 'Оружие',
                'link'      => '#',
                'code'      => 'weapon',
                'image'     => $pathToImage . 'catalog/result/x420/weapon.png',
                'desc'      => 'Для приобретения огнестрельного оружия, а также травматического, необходимо ' .
                                'иметь документы, подтверждающие право пользования.',
                'dropdown'  => [
                    [
                        'title'     => 'Пневматическое',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Травматическое',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Огнестрельное',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Оружие для пейнтбола',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Луки, арбалеты',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Холодное оружие',
                        'link'      => '#',
                    ],
                ],
            ],
            [
                'title'     => 'Средства защиты',
                'link'      => '#',
                'code'      => 'protection',
                'image'     => $pathToImage . 'catalog/result/x420/protection.png',
                'desc'      => 'Все перечисленные товары в этом разделе не являются спец. средствами, ' .
                                'на что имеются подтверждающие документы.',
                'dropdown'  => [
                    [
                        'title'     => 'Шлемы, каски (аксессуары для шлема)',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Бронежилеты',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Наколенники, налокотники',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Тактические перчатки',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Тактическая обувь',
                        'link'      => '#',
                    ],
                ],
            ],
            [
                'title'     => 'Амуниция',
                'link'      => '#',
                'code'      => 'amunition',
                'image'     => $pathToImage . 'catalog/result/x420/amunition.png',
                'desc'      => 'В составе медицинского снаряжения подобраны аптечки и препараты, которые ' .
                                'могут иметь противопоказания к применению. Будте аккуратнее!',
                'dropdown'  => [
                    [
                        'title'     => 'Жилеты разгрузочные',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Медицинское снаряжение',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Рюкзаки, сумки',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Транспортировочные боксы',
                        'link'      => '#',
                    ],
                ],
            ],
            [
                'title'     => 'Спец. средства',
                'link'      => '#',
                'code'      => 'special',
                'image'     => $pathToImage . 'catalog/result/x420/special.png',
                'dropdown'  => [
                    [
                        'title'     => 'Оптические приборы и дальномеры',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'БПЛА',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Компасы и навигаторы',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Тепловизоры иночные приборы',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Средства имитации и целеуказания',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Тактические фонари',
                        'link'      => '#',
                    ],
                ],
            ],
            [
                'title'     => 'Другое',
                'link'      => '#',
                'code'      => 'other',
                'desc'      => 'Приобретая товар данной категории - читайте внимательно инструкции пользования ' .
                                'и эксплуатации того или иного изделия, которое подробно расписано в ' .
                                'соответствующих разделах.',
                'image'     => $pathToImage . 'catalog/result/x420/other.png',
                'dropdown'  => [
                    [
                        'title'     => 'Уход за оружием ' .
                                        '(оружейная химия и наборы для чистки)',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Краска для оружия',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Часы',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Видеокамеры',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Расходные материалы',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Тюнинг',
                        'link'      => '#',
                    ],
                    [
                        'title'     => 'Прицелы',
                        'link'      => '#',
                    ],
                ],
            ],
        ]
    ],
    'news'      => [
        'link'      => '/verstka/news.php',
        'title'     => 'Новости',
    ],
    'video'     => [
        'link'      => '/verstka/video.php',
        'title'     => 'Видео',
    ],
    'about'     => [
        'link'      => '/verstka/about.php',
        'title'     => 'О нас',
    ]
];
